///// DB에 저장이 되는 항목인 경우 CMB_CONST_XXXXX 의 형태로 CONST를 붙임.

CMB_DGN_DECKDIR_PERPENDI_TO_BEAM              = "Perpendicular to Beam"
CMB_DGN_DECKDIR_PARALLEL_TO_BEAM              = "Parallel to Beam"

CMB_LINK_FORCE_TYPE_COLM                      = "Design Force of Column"
CMB_LINK_FORCE_TYPE_NODE                      = "Reaction of Support"

CMB_LINK_DGN_FORCE_TYPE_NEGLECT_DUCTILE       = "Neglect Ductile Design & Magnified Moment"
CMB_LINK_DGN_FORCE_TYPE_CONSIDR_DUCTILE       = "Consider Ductile Design & Magnified Moment"

CMB_LINK_POSITION_IJ                          = "Both I & J"
CMB_LINK_POSITION_II                          = "Only I"
CMB_LINK_POSITION_JJ                          = "Only J"

CMB_LINK_PROGRAM_GNX                          = "midas Gen NX"
CMB_LINK_PROGRAM_GEN                          = "midas Gen"
CMB_LINK_PROGRAM_ADS                          = "midas ADS"

CMB_SOIL_FIND_MAX_BASE_V                      = "by Base Shear ( MAX. )"
CMB_SOIL_FIND_MIN_BASE_V                      = "by Base Shear ( MIN. )"
CMB_SOIL_FIND_MAX_BASE_M                      = "by Base Moment ( MAX. )"
CMB_SOIL_FIND_MIN_BASE_M                      = "by Base Moment ( MIN. )"
